#### Working Directory 📁`terraform/route53`
#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_ecr_repository.default: Refreshing state... [id=terraform-test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.default must be replaced
-/+ resource "aws_ecr_repository" "default" {
      ~ arn                  = "arn:aws:ecr:ap-northeast-1:206863353204:repository/terraform-test" -> (known after apply)
      ~ id                   = "terraform-test" -> (known after apply)
      ~ name                 = "terraform-test" -> "terraform-test3" # forces replacement
      ~ registry_id          = "206863353204" -> (known after apply)
      ~ repository_url       = "206863353204.dkr.ecr.ap-northeast-1.amazonaws.com/terraform-test" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @akashikaikyouohasi, Action: `pull_request`, Working Directory: ``, Workflow: `terraform fmt/validate/plan`*